---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.CurrencyPerBritishThermalUnit
source: html/e992af1c-cb3b-35ca-0b62-f380ba51d3f6.htm
---
# Autodesk.Revit.DB.UnitTypeId.CurrencyPerBritishThermalUnit Property

Cost per British thermal unit.

## Syntax (C#)
```csharp
public static ForgeTypeId CurrencyPerBritishThermalUnit { get; }
```